package com.company;
/*
Напишите программу «Адрес человека». Есть сущность Человек, которая
связана с сущностью Адрес. Считается, что у каждого человека есть только
один адрес. Организовать массив объектов Человек (не менее 4) и по массиву:
 осуществить поиск Человека по фамилии;
 осуществить поиск человека по атрибуту адреса;
 вывести людей, родившихся между определенными датами;
 найти самого старого (молодого);
 найти людей, проживающих на одной улице.
*/
public class Address {
    private String address;
    public Address(String address){
        this.address = address;
    }
    public String toString(){
        return address;
    }
}
